In [3]:
import pandas as pd

In [4]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

df = pd.DataFrame(x)

df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [5]:
x = df[['ID']]

In [6]:
type(x)

pandas.core.frame.DataFrame

In [7]:
z = df[['Department', 'Salary', 'ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [8]:
y = {'Student':['David', 'Samuel', 'Terry', 'Evan'], 'Age':[27,24,22,32], 'Country': ['UK','Canada','China','USA'], 'Course':['Python','Data Structures', 'Machine Learning', 'Web Development'], 'Marks':[85,72,89,76]}
df1 = pd.DataFrame(y)
df1

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [9]:
b = df1[['Marks']]

In [10]:
c = df1[['Country', 'Course']]

In [11]:
x = df['Name']

In [12]:
x

0    Rose
1    John
2    Jane
3    Mary
Name: Name, dtype: object

In [13]:
type(x)

pandas.core.series.Series

In [14]:
df1.iloc[0,0]

'David'

In [16]:
df1.iloc[0,2]

'UK'

In [17]:
df.loc[0, 'Salary']

100000

In [21]:
df2 = df
df2 = df2.set_index('Name')
df3 = df1.set_index('Student')

In [20]:
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [22]:
df3.head()

         Age Country            Course  Marks
Student
David     27      UK            Python     85
Samuel    24  Canada   Data Structures     72
Terry     22   China  Machine Learning     89
Evan      32     USA   Web Development     76

In [23]:
df2.loc['Jane', 'Salary']

50000

In [24]:
df2.loc['Jane','Department']

'Design Team'

In [25]:
df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [26]:
df.loc[0:2, 'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [27]:
df.loc[2:3, 'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

In [28]:
df1.iloc[3,2]

'USA'